versioduo/Recording/Arduino/boards.txt
##############################################################
# Adafruit 32u4 ItsyBitsy 5V @ 16MHz
recording.name=Recording
recording.bootloader.low_fuses=0xff
recording.bootloader.high_fuses=0xd8
recording.bootloader.extended_fuses=0xcb
recording.bootloader.file=caterina/Caterina-Atmega32u4.hex
recording.bootloader.unlock_bits=0x3F
recording.bootloader.lock_bits=0x2F
recording.bootloader.tool=arduino:avrdude
recording.build.mcu=atmega32u4
recording.build.f_cpu=16000000L
recording.build.vid=0x6666
recording.build.pid=0xe258
recording.build.core=arduino:arduino
recording.build.variant=itsybitsy32u4
recording.build.board=AVR_ITSYBITSY32U4_5V
recording.build.usb_product="Recording"
recording.build.usb_manufacturer="V2"
recording.build.extra_flags={build.usb_flags}
recording.upload.protocol=avr109
recording.upload.maximum_size=28672
recording.upload.speed=57600
recording.upload.disable_flushing=true
recording.upload.use_1200bps_touch=true
recording.upload.wait_for_upload_port=true
recording.upload.tool=arduino:avrdude
recording.vid.0=0x239A
recording.pid.0=0x000E